## Importing libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

## Importing a pickle file

In [2]:
# Import pickle file; Create a string of the path for the main project folder
path = r'/Users/rose/Documents/Career Foundry/Instacart Basket Analysis'
df_orders_products_combined = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [3]:
# Check shape
df_orders_products_combined.shape

(32434489, 10)

In [4]:
df_orders_products_combined.head(2)

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both

In [5]:
# drop _merge flag column to prepare for another merge & avoid 2 _merge columns
df_orders_products_combined_2 = df_orders_products_combined.drop(columns = ['_merge'])

In [6]:
df_orders_products_combined_2.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

In [7]:
df_orders_products_combined_2.shape

(32434489, 9)

In [8]:
# Import prods_wrangled5
df_prods_most_recent = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'prods_wrangled5.csv'), index_col = False)

In [9]:
df_prods_most_recent.head(2)

   product_id                product_name  aisle_id  department_id  prices
0           1  Chocolate Sandwich Cookies        61             19     5.8
1           2            All-Seasons Salt       104             13     9.3

In [10]:
df_prods_most_recent.shape

(49672, 5)

In [11]:
# Merge dataframes df_orders_products_combined_2 & df_prods_most_recent
df_ords_prods_merge = df_orders_products_combined_2.merge(df_prods_most_recent, on = 'product_id', indicator = True)

In [12]:
df_ords_prods_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

In [13]:
df_ords_prods_merge.shape

(32404859, 14)

In [14]:
df_ords_prods_merge['_merge'].value_counts(dropna=False)

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

## Exporting a pickle

In [15]:
# Export df_ords_prods_merge dataframe as “ords_prods_merge.pkl” under “Prepared Data” folder.
df_ords_prods_merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_merge.pkl'))